{
  "backend/main.mo": "Defines a posts canister with CRUD-style query methods and date-based sorting, including draft filtering.",
  "backend/migration.mo": "Migrates stored posts by adding an isDraft field defaulting to false.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Contains prewritten one-line summaries for major frontend files.",
  "frontend/DEPLOYMENT.md": "Guide outlining build, verification, and deployment steps for the frontend.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH-based design tokens for light and dark themes.",
  "frontend/index.html": "Root HTML file that loads the React app entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with home, posts list, and post detail routes inside the main layout.",
  "frontend/src/components/PostCard.tsx": "Renders a post preview card using safe date formatting and category badges.",
  "frontend/src/components/SiteFooter.tsx": "Displays footer with branding, quick links, social icons, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Implements the top navigation bar with desktop and mobile menus.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper containing header, routed content, and footer.",
  "frontend/src/content/samplePosts.ts": "Exports an array of sample Post objects used as fallback blog content. Includes metadata like slug, author, datePublished, and body text.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and caches a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context and provider using Internet Identity, exposing identity state, login, logout, and status helpers.",
  "frontend/src/hooks/usePosts.ts": "Defines React Query hooks for fetching posts from the backend with fallbacks to samplePosts when errors or missing actors occur.",
  "frontend/src/index.css": "Configures Tailwind layers and sets up light/dark theme CSS variables along with global typography and utility styles.",
  "frontend/src/lib/postDate.ts": "Provides functions to normalize bigint timestamps and safely format post dates, returning fallbacks for invalid values.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and loads global styles.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero, CTA, features, and post previews using data from usePosts.",
  "frontend/src/pages/PostDetailPage.tsx": "Renders a detailed blog post view with loading and error states, category tags, author/date metadata, and formatted post body text.",
  "frontend/src/pages/PostsListPage.tsx": "Displays a searchable, filterable grid of post cards with category selection and loading placeholders.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, animations, and plugins for the project.",
  "project_state.json": "Stores project metadata, requirements, architectural notes, known issues, and feature definitions for the Zeekly site."
}