{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Zeekly: Resilient date parsing to fix “Invalid time value”",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Make `Post.datePublished` parsing/formatting resilient across post cards and post detail so invalid dates never call `toISOString()` / `toLocaleDateString()`.",
      "acceptanceCriteria": [
        "Browsing the Home page, Posts list, and Post detail pages does not throw \"Invalid time value\" in the browser console.",
        "If a post has a missing/invalid/unparseable `datePublished`, the page still renders and shows a safe fallback (e.g., hides the date or shows an \"Unknown date\" label) without throwing.",
        "The `<time dateTime=...>` attribute is only rendered with a valid ISO string when the parsed date is valid."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/postDate.ts",
          "operation": "create",
          "description": "Add a small utility to safely normalize `Post.datePublished` (bigint) into a valid JS `Date` when possible (including handling common epoch unit mismatches like microseconds/nanoseconds), and provide safe formatted label + optional ISO string only when valid."
        },
        {
          "path": "frontend/src/components/PostCard.tsx",
          "operation": "modify",
          "description": "Replace direct `new Date(Number(post.datePublished))`, `toLocaleDateString()`, and `toISOString()` usage with the shared safe date helper; render a fallback label or hide the date when invalid, and only render the `<time dateTime=...>` attribute when an ISO string is available."
        },
        {
          "path": "frontend/src/pages/PostDetailPage.tsx",
          "operation": "modify",
          "description": "Use the shared safe date helper for `datePublished`; ensure the page renders without throwing when invalid/unparseable, and only render `<time dateTime=...>` when a valid ISO string exists."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Update sample posts to use the same epoch unit as backend `Post.datePublished` (Motoko `Int`) to avoid out-of-range timestamps in JS Date conversion.",
      "acceptanceCriteria": [
        "`frontend/src/content/samplePosts.ts` uses a consistent epoch unit that produces valid JavaScript dates when rendered (no overflow/out-of-range values).",
        "With `actor` unavailable (fallback to `samplePosts`), the Posts list and Post detail pages render dates correctly and do not throw errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/content/samplePosts.ts",
          "operation": "modify",
          "description": "Standardize all `datePublished` values to a consistent, JS-safe epoch unit aligned to the backend representation (e.g., milliseconds since epoch), removing any microsecond/nanosecond multipliers that can create out-of-range values."
        },
        {
          "path": "frontend/src/lib/postDate.ts",
          "operation": "modify",
          "description": "Ensure the normalization logic remains compatible with both backend-provided `datePublished` values and the updated `samplePosts` dates (including robust handling for unexpected units without throwing)."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Prepare and publish the updated frontend build so the live site reflects the date parsing fix.",
      "acceptanceCriteria": [
        "A production build completes successfully.",
        "The live site reflects the fix (no \"Invalid time value\" error when navigating between pages)."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "create",
          "description": "Document the minimal steps to produce a production build and publish the updated frontend (e.g., build command, verification checklist for Home/Posts/Post detail navigation to confirm no \"Invalid time value\" errors), aligned with the repo’s existing deployment workflow."
        },
        {
          "path": "frontend/src/components/PostCard.tsx",
          "operation": "modify",
          "description": "Add a quick manual verification note (comment) near the date rendering logic indicating how to confirm the deployed build no longer throws \"Invalid time value\" when dates are missing/invalid, without changing overall branding/content."
        }
      ]
    }
  ]
}