{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Zeekly tech guest-post blog frontend (landing + blog navigation + themed UI)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Build a modern, minimal, tech-forward Zeekly landing page with structured blog-style sections.",
      "acceptanceCriteria": [
        "Homepage includes a hero section introducing Zeekly as a technology-focused guest post/blog platform",
        "Visual design is consistent across the page: minimal layout, clear typography, tech-forward styling",
        "Homepage contains a structured blog layout section (e.g., featured posts + latest posts) appropriate for guest posting"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Create the root app composition and wire routing to the required landing page and blog pages (home, posts list, post detail)."
        },
        {
          "path": "frontend/src/components/SiteLayout.tsx",
          "operation": "create",
          "description": "Create a shared site layout (header/nav + main container + footer) that enforces a minimal, professional publication structure across pages."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "create",
          "description": "Implement a clean top navigation for Zeekly (logo + primary links like Home/Posts) suitable for a tech publication."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "create",
          "description": "Implement the Zeekly landing page: hero section with tech-oriented identity, structured blog section (e.g., featured + latest), and consistent typography/spacing. Use shadcn-ui components (e.g., Card/Badge/Separator where appropriate) to keep styling cohesive; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/PostCard.tsx",
          "operation": "create",
          "description": "Create a reusable post card for structured blog presentation (title, excerpt, date, categories, author) used across homepage and listing. Use shadcn-ui components (e.g., Card/Badge/Button) for consistent UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/public/assets/generated/zeekly-wordmark.dim_1200x300.png",
          "operation": "create",
          "description": "Add the generated Zeekly wordmark logo asset and wire it into the header/hero branding."
        },
        {
          "path": "frontend/public/assets/generated/zeekly-hero-bg.dim_2400x1200.png",
          "operation": "create",
          "description": "Add the generated abstract minimal tech hero background asset and use it in the homepage hero presentation."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a prominent, native-looking “Lifestyle” CTA button directly after the hero that links to zeekly.co.uk in the same tab.",
      "acceptanceCriteria": [
        "A button labeled exactly “Lifestyle” appears directly after the hero section",
        "Clicking the button navigates to https://zeekly.co.uk/ in the same browser tab (no target=\"_blank\")",
        "Button styling matches the site’s modern tech theme and does not resemble an advertisement"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Insert a prominent CTA immediately after the hero: a button labeled exactly “Lifestyle” linking to https://zeekly.co.uk/ in the same tab (no target=\"_blank\"). Use a shadcn-ui Button (or equivalent) styled to feel native and professional; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement blog navigation with posts listing and post detail views, pre-populated with sample tech-focused content.",
      "acceptanceCriteria": [
        "Users can browse a list of posts and open a post detail page within the site",
        "The UI includes clear post metadata presentation (e.g., title, excerpt, date, category/section)",
        "Sample posts cover the requested topic areas (innovation, software guides, startups, tech news)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PostsListPage.tsx",
          "operation": "create",
          "description": "Create the posts listing page showing a structured list/grid of posts with metadata and clear navigation to detail pages. Use shadcn-ui components (e.g., Card, Badge, Pagination primitives if available) for cohesive presentation; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PostDetailPage.tsx",
          "operation": "create",
          "description": "Create the post detail page rendering title, author, publish date, categories, and full article body with readable typographic layout (e.g., Tailwind typography). Use shadcn-ui components where appropriate; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/content/samplePosts.ts",
          "operation": "create",
          "description": "Add a sample posts dataset covering: tech articles, digital innovation, software guides, startup insights, and trending technology news. Used as initial/fallback content when backend content is unavailable/empty."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Wire navigation links to the posts listing view and ensure users can reach blog pages from anywhere in the site."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register routes for posts listing and post detail views and ensure navigation between list and detail is functional."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fetch posts and individual post details from the existing backend actor and render them in list + detail views with graceful fallback to sample content.",
      "acceptanceCriteria": [
        "Backend exposes query methods to fetch a list of posts and fetch a single post by identifier",
        "Frontend loads posts via the backend actor and renders list + detail views",
        "The solution stays within a single Motoko main actor (no additional backend services)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePosts.ts",
          "operation": "create",
          "description": "Create React Query hooks that use the existing actor access (without modifying immutable hooks) to load: all posts, posts by category, post by slug, and post count; include loading/error states and a fallback to sample posts when needed."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Load homepage featured/latest sections from the backend via the new posts hooks; fall back to the sample dataset if the backend returns no posts or fails."
        },
        {
          "path": "frontend/src/pages/PostsListPage.tsx",
          "operation": "modify",
          "description": "Fetch and render the posts list from the backend actor via the new posts hooks, including empty/loading/error states and fallback sample content."
        },
        {
          "path": "frontend/src/pages/PostDetailPage.tsx",
          "operation": "modify",
          "description": "Fetch and render an individual post by slug from the backend actor; handle not-found by showing a clear in-site message and a link back to the posts list."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Apply and enforce a consistent, distinctive tech publication theme (colors, typography, spacing) across all Zeekly pages and components.",
      "acceptanceCriteria": [
        "A consistent design system is evident across navigation, hero, post cards, and post detail layout",
        "Theme avoids default/unstyled appearance and remains clean and professional",
        "Typography hierarchy (headings/body/meta) is clearly defined and consistent"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Define global theme tokens and base typography (including shadcn-compatible CSS variables if used) to establish a distinctive tech-forward palette, spacing rhythm, and heading/body/meta hierarchy across the site."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Adjust Tailwind theme extensions (e.g., font families, typography defaults, and any brand-specific tokens) to support a consistent tech publication look across components and pages."
        },
        {
          "path": "frontend/src/components/SiteLayout.tsx",
          "operation": "modify",
          "description": "Ensure consistent layout spacing and max-width/container behavior for reading comfort across home, list, and detail views."
        },
        {
          "path": "frontend/src/components/PostCard.tsx",
          "operation": "modify",
          "description": "Refine card typography hierarchy (title, excerpt, meta) and category styling to match the Zeekly theme. Use shadcn-ui components as needed; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PostDetailPage.tsx",
          "operation": "modify",
          "description": "Apply consistent reading layout and typographic styling (headings, paragraph spacing, meta) aligned with the global theme, keeping the page minimal and professional."
        }
      ]
    }
  ]
}